clear
format compact
close all

%q=[x,xd,θ,θd,β,y,yd,Φ,Φd,γ,z,zd]'
% パラメータ
r = 0.6;% λ=2/3Lp
%r = 0.1;
g = 9.81; % 重力加速度 [m/s^2]

A = [0 1 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 g 0 0 0 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0 0 0;
    0 0 g/r 0 -g/r 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 -g 0 0;
    0 0 0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 g/r 0 -g/r 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 1;
    0 0 0 0 0 0 0 0 0 0 0 0;];

B = [0 0 0;
    0 0 0;
    0 0 0;
    0 0 0;
    1 0 0;
    0 0 0;
    0 0 0;
    0 0 0;
    0 0 0;
    0 1 0;
    0 0 0;
    0 0 1;];

C = [1 0 0 0 0 0 0 0 0 0 0 0];

At = [A, zeros(size(A, 1), 1); -C, 0];
Bt = [ B; 0 0 0];

%重みの決定
Q = diag([1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]);
R=diag([1,1,1]);

%lqr法
K = lqr(At, Bt, Q, R); % K がフィードバックゲイン行列
K1 = K(:, 1:12);
K2 = K(:, 13);

% シミュレーションの設定
Tf = 10;  % シミュレーション時間 [s]
Ts = 0.05; % サンプリング時間 [s]
T = 0:Ts:Tf;  % シミュレーションの時間軸
N = length(T);  % シミュレーションの時間ステップ数(=201)

% 目標値の定義
q_ref = zeros(13, N);
r0 = 1; % [m]?

% 初期状態
q0 = [0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0];

% 制御入力の初期化
u = zeros(3, N);

% シミュレーションの実行
q = zeros(13, N);
dq = zeros(13, N);
q(:, 1) = q0;
for k = 1:N-1

    % 状態フィードバックによる制御入力の計算
    u(:,k) = -K*(q(:,k) - q_ref(:,k));

    %状態方程式の計算 13状態
    dq(:,k) = [q(2,k);
               (g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*sin(q(5,k));
               q(4,k);
               -q(9,k)*q(9,k)*sin(q(3,k))*cos(q(3,k))+(1/r)*(-((g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*sin(q(5,k)))*cos(q(3,k))-(-(g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*sin(q(10,k))*cos(q(5,k)))*sin(q(8,k))*sin(q(3,k))+(((g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*cos(q(5,k))*cos(q(10,k)))-g+g)*cos(q(8,k))*sin(q(3,k)));
               u(1,k);
               q(7,k);
               -(g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*sin(q(10,k))*cos(q(5,k));
               q(9,k);
               2*q(4,k)*q(9,k)*tan(q(3,k))+(1/r)*(1/cos(q(3,k)))*((-(g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*sin(q(10,k))*cos(q(5,k)))*cos(q(8,k))+(((g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*cos(q(5,k))*cos(q(10,k)))-g+g)*sin(q(8,k)));
               u(2,k)/cos(q(5,k));
               q(12,k);
               (g+0.5*g*(q(5,k)*q(5,k)+q(10,k)*q(10,k))+u(3,k))*cos(q(5,k))*cos(q(10,k))-g];
                

    % 1ステップ先の状態の更新
    q(:, k+1) = q(:,k) + dq(:,k)*Ts;
end

% %結果のプロット
% figure;
% plot(T,q(1,:),'DisplayName','x');
% hold on;
% plot(T,q(6,:),'DisplayName','y');
% plot(T,q(11,:),'DisplayName','z');
% plot(T,q(3,:),'DisplayName','θ');
% plot(T,q(8,:),'DisplayName','Φ');
% legend('show');
% xlabel('Time[s]');
% ylabel('State');
% grid on;